LEXICON_MAIN_MENU: dict[str, str] = {
    '/random': 'Рандомный факт 🧠',
    '/gpt': 'ChatGPT интерфейс 🤖',
    '/talk': 'Диалог с известной личностью 👤',
    '/quiz': 'Квиз ❓',
    '/cook': 'Рецепт 🍅',
}

LEXICON_FACTS: dict[str, str] = {
    'next_fact': 'Следующий факт'
}

LEXICON_TALKS: dict[str, str] = {
    'grande': 'Ариа́на Гра́нде - американская певица, актриса 💃',
    'hardy': 'Том Харди - британский актёр, продюсер и сценарист 🎦',
    'tolkien': 'Джон Толкин - Автор книги "Властелин Колец" 📖',
}

LEXICON_QUIZ: dict[str, str] = {
    'quiz_biology': 'Биология 🔬',
    'quiz_math': 'Математика 🧮',
    'quiz_prog': 'Программирование на Python 💻',
}

LEXICON_NEXT_QUIZ: dict[str, str] = {
    'next_quiz': 'Следующий вопрос'
}

LEXICON_NEXT_COOK: dict[str, str] = {
    'next_cook': 'Следующий рецепт'
}